<p>Uivatelsk&aacute; pø&iacute;ruèka ke høe Ztracen&yacute; telefon <br />Semestr&aacute;ln&iacute; pr&aacute;ce na pøedmìt 4IT101 <br /><br />Jan Mand&iacute;k <br /><br />manj01@vse.cz <br /><br /><br /><br />Pø&iacute;bìh: Jsi &uacute;spì&scaron;n&yacute; obchodn&iacute;k, kter&yacute; oèek&aacute;v&aacute; dùleit&yacute; telefon&aacute;t ve 12 hodin. Vzbudil ses, na podle <br />hodin&aacute;ch je za pìt minut dvan&aacute;ct a uvìdomil sis, e jsi vèera pøi n&aacute;vratu domù nìkde ve sv&eacute;m velk&eacute;m <br />bytì za&scaron;antroèil svùj telefon, kter&yacute; mìl v tu chv&iacute;li zrovna vybitou baterku. Mus&iacute;&scaron; ho naj&iacute;t, nebo tvoje <br />kari&eacute;ra skonè&iacute;. Ale pozor, tvùj byt je docela velik&yacute; a nebydl&iacute;&scaron; v nìm s&aacute;m! <br /><br />Funkce hry: Z&aacute;kladem hry jsou m&iacute;stnosti, kter&eacute; se proch&aacute;z&iacute; pø&iacute;kazem jdi. V m&iacute;stech mùou b&yacute;t vìci, <br />kter&eacute; mùeme prozkoumat nebo zkusit sebrat, nicm&eacute;nì ne v&scaron;echny jdou sebrat. Tak&eacute; mùou b&yacute;t <br />v m&iacute;stnostech osoby, se kter&yacute;mi lze mluvit pø&iacute;kazem mluv. Hra lze kdykoliv ukonèit pø&iacute;kazem konec. <br /><br />Pø&iacute;kazy <br />Formulace Funkce <br />napoveda Vyp&iacute;&scaron;e pø&iacute;kazy a dal&scaron;&iacute; uiteèn&eacute; informace <br />jdi (m&iacute;s tnost) Je-li to mon&eacute;, pøesune hr&aacute;èe do zadan&eacute; <br />m&iacute;stnosti <br />konec Ukonè&iacute; hru <br />vezmi (pøedmìt v m&iacute;stnosti) Pøesune pøedmìt do baohu, povoluje-li to <br />pøedmìt a nen&iacute;-li batoh pøeplnìn&yacute; (kapacita 2) <br />prokoumej (pøedmìt v m&iacute;stnosti) Vyp&iacute;&scaron;e dal&scaron;&iacute; informace k pøedmìtu <br />zahod (pøedmìt v baohu) Pøesune pøedmìt z baohu do aktu&aacute;ln&iacute; m&iacute;stnosti <br />mluv (osoba v m&iacute;stnosti) Vyp&iacute;&scaron;e to, co ø&iacute;k&aacute; dan&aacute; osoba <br />pouzij (vìc v baohu) Pouije pøedmìt v m&iacute;stnosti <br />batoh Vyp&iacute;&scaron;e seznam vìc&iacute; v baohu <br /><br /><br /></p>
<p>----------------------- Page 2-----------------------</p>
<p><br /><br />M&iacute;stnosti <br />Hra zaè&iacute;n&aacute; v lonici. <br /><br />Lonice <br /><br />Kuchynì Z&aacute;chod <br /><br />Hala <br /><br />Koupelna Pracovna <br /><br /><br /><br />Spu&scaron;tìn&iacute; <br />Hru je mon&eacute; spustit pø&iacute;kazem <br /><br />java &ndash;Dfile.encoding=CP852 &ndash;jar hledani-telefonu.jar <br /><br />zadan&eacute;ho z pø&iacute;kazov&eacute;ho ø&aacute;du (je tøeba b&yacute;t ve sloce, kde je ztraceny_telefon.jar uloen. (Pø&iacute;kazov&yacute; <br />ø&aacute;dek pro sloku, kde se zrovna nach&aacute;z&iacute;te nejsn&aacute;ze otevøete stisknut&iacute;m prav&eacute;ho tlaè&iacute;tka my&scaron;i a shift a <br />n&aacute;sledn&eacute;ho vybr&aacute;n&iacute; pø&iacute;slu&scaron;n&eacute; monosti.)</p>